# HostElement Property (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
BoundaryConditions..::..HostElement Property
BoundaryConditions Class See Also
---
The host element for the boundary conditions.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
# Syntax
C#
---
```text
public AnalyticalModel HostElement { get; }
```

Visual Basic
---
```text
Public ReadOnly Property HostElement As AnalyticalModel
	Get
```

Visual C++
---
```text
public:
property AnalyticalModel^ HostElement {
	AnalyticalModel^ get ();
}
```

# See Also
BoundaryConditions Class
Autodesk.Revit.DB.Structure Namespace